TestServicesSoap/src/test/resources/soap/filenumbertowords.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <NumberToWords xmlns="http://www.dataaccess.com/webservicesserver/">
            <ubiNum>%s</ubiNum>
        </NumberToWords>
    </soap:Body>
</soap:Envelope>